MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A12C0AGN20000/mcu.h
/*******************************************************************************
* QPRC_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t QPCR;
        struct {
            __IO  uint8_t QPCRL;
            __IO  uint8_t QPCRH;
        };
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO uint16_t QRCR;
        struct {
            __IO  uint8_t QRCRL;
            __IO  uint8_t QRCRH;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO uint16_t QPCCR;
        struct {
            __IO  uint8_t QPCCRL;
            __IO  uint8_t QPCCRH;
        };
    };
        __IO  uint8_t RESERVED2[2];
    union {
        __IO uint16_t QPRCR;
        struct {
            __IO  uint8_t QPRCRL;
            __IO  uint8_t QPRCRH;
        };
    };
        __IO  uint8_t RESERVED3[2];
    union {
        __IO uint16_t QMPR;
        struct {
            __IO  uint8_t QMPRL;
            __IO  uint8_t QMPRH;
        };
    };
        __IO  uint8_t RESERVED4[2];
    union {
        __IO  uint8_t QICRL;
        stc_qprc_qicrl_field_t QICRL_f;
    };
    union {
        __IO  uint8_t QICRH;
        stc_qprc_qicrh_field_t QICRH_f;
    };
        __IO  uint8_t RESERVED5[2];
    union {
        __IO uint16_t QCR;
        stc_qprc_qcr_field_t QCR_f;
        struct {
            __IO  uint8_t QCRL;
            __IO  uint8_t QCRH;
        };
    };
        __IO  uint8_t RESERVED6[2];
    union {
        __IO uint16_t QECR;
        stc_qprc_qecr_field_t QECR_f;
        struct {
            __IO  uint8_t QECRL;
            __IO  uint8_t QECRH;
        };
    };
        __IO  uint8_t RESERVED7[30];
    union {
        __IO uint32_t QPRCRR;
        stc_qprc_qprcrr_field_t QPRCRR_f;
        struct {
          union {
            __IO uint16_t QPRCRRL;
            struct {
              __IO uint8_t QPRCRRLL;
              __IO uint8_t QPRCRRLH;
            };
          };
          union {
            __IO uint16_t QPRCRRH;
            struct {
              __IO uint8_t QPRCRRHL;
              __IO uint8_t QPRCRRHH;
            };
          };
        };
    };
} FM_QPRC_TypeDef, FM0P_QPRC_TypeDef;

/*******************************************************************************
* QPRC_NF_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t NFCTLA;
        stc_qprc_nf_nfctla_field_t NFCTLA_f;
        struct {
            __IO  uint8_t NFCTLAL;
            __IO  uint8_t NFCTLAH;
        };
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO uint16_t NFCTLB;
        stc_qprc_nf_nfctlb_field_t NFCTLB_f;
        struct {
            __IO  uint8_t NFCTLBL;
            __IO  uint8_t NFCTLBH;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO uint16_t NFCTLZ;
        stc_qprc_nf_nfctlz_field_t NFCTLZ_f;
        struct {
            __IO  uint8_t NFCTLZL;
            __IO  uint8_t NFCTLZH;
        };
    };
} FM_QPRC_NF_TypeDef, FM0P_QPRC_NF_TypeDef;

/*******************************************************************************
* RTC_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t WTCR1;
        stc_rtc_wtcr1_field_t WTCR1_f;
        struct {
          union {
            __IO uint16_t WTCR1L;
            struct {
              __IO uint8_t WTCR1LL;
              __IO uint8_t WTCR1LH;
            };
          };
          union {
            __IO uint16_t WTCR1H;
            struct {
              __IO uint8_t WTCR1HL;
              __IO uint8_t WTCR1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t WTCR2;
        stc_rtc_wtcr2_field_t WTCR2_f;
        struct {
          union {
            __IO uint16_t WTCR2L;
            struct {
              __IO uint8_t WTCR2LL;
              __IO uint8_t WTCR2LH;
            };
          };
          union {
            __IO uint16_t WTCR2H;
            struct {
              __IO uint8_t WTCR2HL;
              __IO uint8_t WTCR2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t WTBR;
        stc_rtc_wtbr_field_t WTBR_f;
        struct {
          union {
            __IO uint16_t WTBRL;
            struct {
              __IO uint8_t WTBRLL;
              __IO uint8_t WTBRLH;
            };
          };
          union {
            __IO uint16_t WTBRH;
            struct {
              __IO uint8_t WTBRHL;
              __IO uint8_t WTBRHH;
            };
          };
        };
    };
    union {
        __IO  uint8_t WTSR;
        stc_rtc_wtsr_field_t WTSR_f;
    };
    union {
        __IO  uint8_t WTMIR;
        stc_rtc_wtmir_field_t WTMIR_f;
    };
    union {
        __IO  uint8_t WTHR;
        stc_rtc_wthr_field_t WTHR_f;
    };
    union {
        __IO  uint8_t WTDR;
        stc_rtc_wtdr_field_t WTDR_f;
    };
    union {
        __IO  uint8_t WTDW;
        stc_rtc_wtdw_field_t WTDW_f;
    };
    union {
        __IO  uint8_t WTMOR;
        stc_rtc_wtmor_field_t WTMOR_f;
    };
    union {
        __IO  uint8_t WTYR;
        stc_rtc_wtyr_field_t WTYR_f;
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO  uint8_t ALMIR;
        stc_rtc_almir_field_t ALMIR_f;
    };
    union {
        __IO  uint8_t ALHR;
        stc_rtc_alhr_field_t ALHR_f;
    };
    union {
        __IO  uint8_t ALDR;
        stc_rtc_aldr_field_t ALDR_f;
    };
        __IO  uint8_t RESERVED1[1];
    union {
        __IO  uint8_t ALMOR;
        stc_rtc_almor_field_t ALMOR_f;
    };
    union {
        __IO  uint8_t ALYR;
        stc_rtc_alyr_field_t ALYR_f;
    };
        __IO  uint8_t RESERVED2[1];
    union {
        __IO uint32_t WTTR;
        stc_rtc_wttr_field_t WTTR_f;
        struct {
          union {
            __IO uint16_t WTTRL;
            struct {
              __IO uint8_t WTTRLL;
              __IO uint8_t WTTRLH;
            };
          };
          union {
            __IO uint16_t WTTRH;
            struct {
              __IO uint8_t WTTRHL;
              __IO uint8_t WTTRHH;
            };
          };
        };
    };
    union {
        __IO  uint8_t WTCLKS;
        stc_rtc_wtclks_field_t WTCLKS_f;
    };
    union {
        __IO  uint8_t WTCLKM;
        stc_rtc_wtclkm_field_t WTCLKM_f;
    };
        __IO  uint8_t RESERVED3[2];
    union {
        __IO uint16_t WTCAL;
        stc_rtc_wtcal_field_t WTCAL_f;
        struct {
            __IO  uint8_t WTCALL;
            __IO  uint8_t WTCALH;
        };
    };
    union {
        __IO  uint8_t WTCALEN;
        stc_rtc_wtcalen_field_t WTCALEN_f;
    };
        __IO  uint8_t RESERVED4[1];
    union {
        __IO  uint8_t WTDIV;
        stc_rtc_wtdiv_field_t WTDIV_f;
    };
    union {
        __IO  uint8_t WTDIVEN;
        stc_rtc_wtdiven_field_t WTDIVEN_f;
    };
        __IO  uint8_t RESERVED5[2];
    union {
        __IO  uint8_t WTCALPRD;
        stc_rtc_wtcalprd_field_t WTCALPRD_f;
    };
        __IO  uint8_t RESERVED6[3];
    union {
        __IO  uint8_t WTCOSEL;
        stc_rtc_wtcosel_field_t WTCOSEL_f;
    };
} FM_RTC_TypeDef, FM0P_RTC_TypeDef;

