MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A12C0AGN20000/mcu.h
/*******************************************************************************
* EXTI Registers EXTI
*   Register Definition
*******************************************************************************/
#define FM_EXTI_ENIR                              *((volatile uint32_t*)(0x40030000UL))
#define FM0P_EXTI_ENIR                            *((volatile uint32_t*)(0x40030000UL))
#define FM_EXTI_EIRR                              *((volatile uint32_t*)(0x40030004UL))
#define FM0P_EXTI_EIRR                            *((volatile uint32_t*)(0x40030004UL))
#define FM_EXTI_EICL                              *((volatile uint32_t*)(0x40030008UL))
#define FM0P_EXTI_EICL                            *((volatile uint32_t*)(0x40030008UL))
#define FM_EXTI_ELVR                              *((volatile uint32_t*)(0x4003000CUL))
#define FM0P_EXTI_ELVR                            *((volatile uint32_t*)(0x4003000CUL))
#define FM_EXTI_ELVR1                             *((volatile uint32_t*)(0x40030010UL))
#define FM0P_EXTI_ELVR1                           *((volatile uint32_t*)(0x40030010UL))
#define FM_EXTI_NMIRR                             *((volatile uint16_t*)(0x40030014UL))
#define FM0P_EXTI_NMIRR                           *((volatile uint16_t*)(0x40030014UL))
#define FM_EXTI_NMICL                             *((volatile uint16_t*)(0x40030018UL))
#define FM0P_EXTI_NMICL                           *((volatile uint16_t*)(0x40030018UL))

/*******************************************************************************
* FASTIO Registers FASTIO
*   Register Definition
*******************************************************************************/
#define FM_FASTIO_FPDIR0                          *((volatile uint32_t*)(0xF8000000UL))
#define FM0P_FASTIO_FPDIR0                        *((volatile uint32_t*)(0xF8000000UL))
#define FM_FASTIO_FPDIR1                          *((volatile uint32_t*)(0xF8000004UL))
#define FM0P_FASTIO_FPDIR1                        *((volatile uint32_t*)(0xF8000004UL))
#define FM_FASTIO_FPDIR2                          *((volatile uint32_t*)(0xF8000008UL))
#define FM0P_FASTIO_FPDIR2                        *((volatile uint32_t*)(0xF8000008UL))
#define FM_FASTIO_FPDIR3                          *((volatile uint32_t*)(0xF800000CUL))
#define FM0P_FASTIO_FPDIR3                        *((volatile uint32_t*)(0xF800000CUL))
#define FM_FASTIO_FPDIR4                          *((volatile uint32_t*)(0xF8000010UL))
#define FM0P_FASTIO_FPDIR4                        *((volatile uint32_t*)(0xF8000010UL))
#define FM_FASTIO_FPDIR5                          *((volatile uint32_t*)(0xF8000014UL))
#define FM0P_FASTIO_FPDIR5                        *((volatile uint32_t*)(0xF8000014UL))
#define FM_FASTIO_FPDIR6                          *((volatile uint32_t*)(0xF8000018UL))
#define FM0P_FASTIO_FPDIR6                        *((volatile uint32_t*)(0xF8000018UL))
#define FM_FASTIO_FPDIR7                          *((volatile uint32_t*)(0xF800001CUL))
#define FM0P_FASTIO_FPDIR7                        *((volatile uint32_t*)(0xF800001CUL))
#define FM_FASTIO_FPDIR8                          *((volatile uint32_t*)(0xF8000020UL))
#define FM0P_FASTIO_FPDIR8                        *((volatile uint32_t*)(0xF8000020UL))
#define FM_FASTIO_FPDIR9                          *((volatile uint32_t*)(0xF8000024UL))
#define FM0P_FASTIO_FPDIR9                        *((volatile uint32_t*)(0xF8000024UL))
#define FM_FASTIO_FPDIRA                          *((volatile uint32_t*)(0xF8000028UL))
#define FM0P_FASTIO_FPDIRA                        *((volatile uint32_t*)(0xF8000028UL))
#define FM_FASTIO_FPDIRB                          *((volatile uint32_t*)(0xF800002CUL))
#define FM0P_FASTIO_FPDIRB                        *((volatile uint32_t*)(0xF800002CUL))
#define FM_FASTIO_FPDIRC                          *((volatile uint32_t*)(0xF8000030UL))
#define FM0P_FASTIO_FPDIRC                        *((volatile uint32_t*)(0xF8000030UL))
#define FM_FASTIO_FPDIRD                          *((volatile uint32_t*)(0xF8000034UL))
#define FM0P_FASTIO_FPDIRD                        *((volatile uint32_t*)(0xF8000034UL))
#define FM_FASTIO_FPDIRE                          *((volatile uint32_t*)(0xF8000038UL))
#define FM0P_FASTIO_FPDIRE                        *((volatile uint32_t*)(0xF8000038UL))
#define FM_FASTIO_FPDIRF                          *((volatile uint32_t*)(0xF800003CUL))
#define FM0P_FASTIO_FPDIRF                        *((volatile uint32_t*)(0xF800003CUL))
#define FM_FASTIO_FPDOR0                          *((volatile uint32_t*)(0xF8000040UL))
#define FM0P_FASTIO_FPDOR0                        *((volatile uint32_t*)(0xF8000040UL))
#define FM_FASTIO_FPDOR1                          *((volatile uint32_t*)(0xF8000044UL))
#define FM0P_FASTIO_FPDOR1                        *((volatile uint32_t*)(0xF8000044UL))
#define FM_FASTIO_FPDOR2                          *((volatile uint32_t*)(0xF8000048UL))
#define FM0P_FASTIO_FPDOR2                        *((volatile uint32_t*)(0xF8000048UL))
#define FM_FASTIO_FPDOR3                          *((volatile uint32_t*)(0xF800004CUL))
#define FM0P_FASTIO_FPDOR3                        *((volatile uint32_t*)(0xF800004CUL))
#define FM_FASTIO_FPDOR4                          *((volatile uint32_t*)(0xF8000050UL))
#define FM0P_FASTIO_FPDOR4                        *((volatile uint32_t*)(0xF8000050UL))
#define FM_FASTIO_FPDOR5                          *((volatile uint32_t*)(0xF8000054UL))
#define FM0P_FASTIO_FPDOR5                        *((volatile uint32_t*)(0xF8000054UL))
#define FM_FASTIO_FPDOR6                          *((volatile uint32_t*)(0xF8000058UL))
#define FM0P_FASTIO_FPDOR6                        *((volatile uint32_t*)(0xF8000058UL))
#define FM_FASTIO_FPDOR7                          *((volatile uint32_t*)(0xF800005CUL))
#define FM0P_FASTIO_FPDOR7                        *((volatile uint32_t*)(0xF800005CUL))
#define FM_FASTIO_FPDOR8                          *((volatile uint32_t*)(0xF8000060UL))
#define FM0P_FASTIO_FPDOR8                        *((volatile uint32_t*)(0xF8000060UL))
#define FM_FASTIO_FPDOR9                          *((volatile uint32_t*)(0xF8000064UL))
#define FM0P_FASTIO_FPDOR9                        *((volatile uint32_t*)(0xF8000064UL))
#define FM_FASTIO_FPDORA                          *((volatile uint32_t*)(0xF8000068UL))
#define FM0P_FASTIO_FPDORA                        *((volatile uint32_t*)(0xF8000068UL))
#define FM_FASTIO_FPDORB                          *((volatile uint32_t*)(0xF800006CUL))
#define FM0P_FASTIO_FPDORB                        *((volatile uint32_t*)(0xF800006CUL))
#define FM_FASTIO_FPDORC                          *((volatile uint32_t*)(0xF8000070UL))
#define FM0P_FASTIO_FPDORC                        *((volatile uint32_t*)(0xF8000070UL))
#define FM_FASTIO_FPDORD                          *((volatile uint32_t*)(0xF8000074UL))
#define FM0P_FASTIO_FPDORD                        *((volatile uint32_t*)(0xF8000074UL))
#define FM_FASTIO_FPDORE                          *((volatile uint32_t*)(0xF8000078UL))
#define FM0P_FASTIO_FPDORE                        *((volatile uint32_t*)(0xF8000078UL))
#define FM_FASTIO_FPDORF                          *((volatile uint32_t*)(0xF800007CUL))
#define FM0P_FASTIO_FPDORF                        *((volatile uint32_t*)(0xF800007CUL))
#define FM_FASTIO_M_FPDIR0                        *((volatile uint32_t*)(0xF8000080UL))
#define FM0P_FASTIO_M_FPDIR0                      *((volatile uint32_t*)(0xF8000080UL))
#define FM_FASTIO_M_FPDIR1                        *((volatile uint32_t*)(0xF8000084UL))
#define FM0P_FASTIO_M_FPDIR1                      *((volatile uint32_t*)(0xF8000084UL))
#define FM_FASTIO_M_FPDOR0                        *((volatile uint32_t*)(0xF80000C0UL))
#define FM0P_FASTIO_M_FPDOR0                      *((volatile uint32_t*)(0xF80000C0UL))
#define FM_FASTIO_M_FPDOR1                        *((volatile uint32_t*)(0xF80000C4UL))
#define FM0P_FASTIO_M_FPDOR1                      *((volatile uint32_t*)(0xF80000C4UL))

