MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A12C0AGN20000/mcu.h
/*******************************************************************************
* MFT Registers MFT0
*   Bitband Section
*******************************************************************************/
#define bFM_MFT0_ADCMP_ACSD0_AMOD                 *((volatile  uint8_t *)(0x42403AA0UL))
#define bFM0P_MFT0_ADCMP_ACSD0_AMOD               *((volatile  uint8_t *)(0x42403AA0UL))
#define bFM_MFT0_ADCMP_ACSD0_OCUS                 *((volatile  uint8_t *)(0x42403AA4UL))
#define bFM0P_MFT0_ADCMP_ACSD0_OCUS               *((volatile  uint8_t *)(0x42403AA4UL))
#define bFM_MFT0_ADCMP_ACSD0_DE                   *((volatile  uint8_t *)(0x42403AB0UL))
#define bFM0P_MFT0_ADCMP_ACSD0_DE                 *((volatile  uint8_t *)(0x42403AB0UL))
#define bFM_MFT0_ADCMP_ACSD0_PE                   *((volatile  uint8_t *)(0x42403AB4UL))
#define bFM0P_MFT0_ADCMP_ACSD0_PE                 *((volatile  uint8_t *)(0x42403AB4UL))
#define bFM_MFT0_ADCMP_ACSD0_UE                   *((volatile  uint8_t *)(0x42403AB8UL))
#define bFM0P_MFT0_ADCMP_ACSD0_UE                 *((volatile  uint8_t *)(0x42403AB8UL))
#define bFM_MFT0_ADCMP_ACSD0_ZE                   *((volatile  uint8_t *)(0x42403ABCUL))
#define bFM0P_MFT0_ADCMP_ACSD0_ZE                 *((volatile  uint8_t *)(0x42403ABCUL))

#define bFM_MFT0_ADCMP_ACSD1_AMOD                 *((volatile  uint8_t *)(0x42403B20UL))
#define bFM0P_MFT0_ADCMP_ACSD1_AMOD               *((volatile  uint8_t *)(0x42403B20UL))
#define bFM_MFT0_ADCMP_ACSD1_OCUS                 *((volatile  uint8_t *)(0x42403B24UL))
#define bFM0P_MFT0_ADCMP_ACSD1_OCUS               *((volatile  uint8_t *)(0x42403B24UL))
#define bFM_MFT0_ADCMP_ACSD1_DE                   *((volatile  uint8_t *)(0x42403B30UL))
#define bFM0P_MFT0_ADCMP_ACSD1_DE                 *((volatile  uint8_t *)(0x42403B30UL))
#define bFM_MFT0_ADCMP_ACSD1_PE                   *((volatile  uint8_t *)(0x42403B34UL))
#define bFM0P_MFT0_ADCMP_ACSD1_PE                 *((volatile  uint8_t *)(0x42403B34UL))
#define bFM_MFT0_ADCMP_ACSD1_UE                   *((volatile  uint8_t *)(0x42403B38UL))
#define bFM0P_MFT0_ADCMP_ACSD1_UE                 *((volatile  uint8_t *)(0x42403B38UL))
#define bFM_MFT0_ADCMP_ACSD1_ZE                   *((volatile  uint8_t *)(0x42403B3CUL))
#define bFM0P_MFT0_ADCMP_ACSD1_ZE                 *((volatile  uint8_t *)(0x42403B3CUL))

#define bFM_MFT0_ADCMP_ACSD2_AMOD                 *((volatile  uint8_t *)(0x42403BA0UL))
#define bFM0P_MFT0_ADCMP_ACSD2_AMOD               *((volatile  uint8_t *)(0x42403BA0UL))
#define bFM_MFT0_ADCMP_ACSD2_OCUS                 *((volatile  uint8_t *)(0x42403BA4UL))
#define bFM0P_MFT0_ADCMP_ACSD2_OCUS               *((volatile  uint8_t *)(0x42403BA4UL))
#define bFM_MFT0_ADCMP_ACSD2_DE                   *((volatile  uint8_t *)(0x42403BB0UL))
#define bFM0P_MFT0_ADCMP_ACSD2_DE                 *((volatile  uint8_t *)(0x42403BB0UL))
#define bFM_MFT0_ADCMP_ACSD2_PE                   *((volatile  uint8_t *)(0x42403BB4UL))
#define bFM0P_MFT0_ADCMP_ACSD2_PE                 *((volatile  uint8_t *)(0x42403BB4UL))
#define bFM_MFT0_ADCMP_ACSD2_UE                   *((volatile  uint8_t *)(0x42403BB8UL))
#define bFM0P_MFT0_ADCMP_ACSD2_UE                 *((volatile  uint8_t *)(0x42403BB8UL))
#define bFM_MFT0_ADCMP_ACSD2_ZE                   *((volatile  uint8_t *)(0x42403BBCUL))
#define bFM0P_MFT0_ADCMP_ACSD2_ZE                 *((volatile  uint8_t *)(0x42403BBCUL))

#define bFM_MFT0_ADCMP_ACSD3_AMOD                 *((volatile  uint8_t *)(0x42403C20UL))
#define bFM0P_MFT0_ADCMP_ACSD3_AMOD               *((volatile  uint8_t *)(0x42403C20UL))
#define bFM_MFT0_ADCMP_ACSD3_OCUS                 *((volatile  uint8_t *)(0x42403C24UL))
#define bFM0P_MFT0_ADCMP_ACSD3_OCUS               *((volatile  uint8_t *)(0x42403C24UL))
#define bFM_MFT0_ADCMP_ACSD3_DE                   *((volatile  uint8_t *)(0x42403C30UL))
#define bFM0P_MFT0_ADCMP_ACSD3_DE                 *((volatile  uint8_t *)(0x42403C30UL))
#define bFM_MFT0_ADCMP_ACSD3_PE                   *((volatile  uint8_t *)(0x42403C34UL))
#define bFM0P_MFT0_ADCMP_ACSD3_PE                 *((volatile  uint8_t *)(0x42403C34UL))
#define bFM_MFT0_ADCMP_ACSD3_UE                   *((volatile  uint8_t *)(0x42403C38UL))
#define bFM0P_MFT0_ADCMP_ACSD3_UE                 *((volatile  uint8_t *)(0x42403C38UL))
#define bFM_MFT0_ADCMP_ACSD3_ZE                   *((volatile  uint8_t *)(0x42403C3CUL))
#define bFM0P_MFT0_ADCMP_ACSD3_ZE                 *((volatile  uint8_t *)(0x42403C3CUL))

#define bFM_MFT0_ADCMP_ACSD4_AMOD                 *((volatile  uint8_t *)(0x42403CA0UL))
#define bFM0P_MFT0_ADCMP_ACSD4_AMOD               *((volatile  uint8_t *)(0x42403CA0UL))
#define bFM_MFT0_ADCMP_ACSD4_OCUS                 *((volatile  uint8_t *)(0x42403CA4UL))
#define bFM0P_MFT0_ADCMP_ACSD4_OCUS               *((volatile  uint8_t *)(0x42403CA4UL))
#define bFM_MFT0_ADCMP_ACSD4_DE                   *((volatile  uint8_t *)(0x42403CB0UL))
#define bFM0P_MFT0_ADCMP_ACSD4_DE                 *((volatile  uint8_t *)(0x42403CB0UL))
#define bFM_MFT0_ADCMP_ACSD4_PE                   *((volatile  uint8_t *)(0x42403CB4UL))
#define bFM0P_MFT0_ADCMP_ACSD4_PE                 *((volatile  uint8_t *)(0x42403CB4UL))
#define bFM_MFT0_ADCMP_ACSD4_UE                   *((volatile  uint8_t *)(0x42403CB8UL))
#define bFM0P_MFT0_ADCMP_ACSD4_UE                 *((volatile  uint8_t *)(0x42403CB8UL))
#define bFM_MFT0_ADCMP_ACSD4_ZE                   *((volatile  uint8_t *)(0x42403CBCUL))
#define bFM0P_MFT0_ADCMP_ACSD4_ZE                 *((volatile  uint8_t *)(0x42403CBCUL))

#define bFM_MFT0_ADCMP_ACSD5_AMOD                 *((volatile  uint8_t *)(0x42403D20UL))
#define bFM0P_MFT0_ADCMP_ACSD5_AMOD               *((volatile  uint8_t *)(0x42403D20UL))
#define bFM_MFT0_ADCMP_ACSD5_OCUS                 *((volatile  uint8_t *)(0x42403D24UL))
#define bFM0P_MFT0_ADCMP_ACSD5_OCUS               *((volatile  uint8_t *)(0x42403D24UL))
#define bFM_MFT0_ADCMP_ACSD5_DE                   *((volatile  uint8_t *)(0x42403D30UL))
#define bFM0P_MFT0_ADCMP_ACSD5_DE                 *((volatile  uint8_t *)(0x42403D30UL))
#define bFM_MFT0_ADCMP_ACSD5_PE                   *((volatile  uint8_t *)(0x42403D34UL))
#define bFM0P_MFT0_ADCMP_ACSD5_PE                 *((volatile  uint8_t *)(0x42403D34UL))
#define bFM_MFT0_ADCMP_ACSD5_UE                   *((volatile  uint8_t *)(0x42403D38UL))
#define bFM0P_MFT0_ADCMP_ACSD5_UE                 *((volatile  uint8_t *)(0x42403D38UL))
#define bFM_MFT0_ADCMP_ACSD5_ZE                   *((volatile  uint8_t *)(0x42403D3CUL))
#define bFM0P_MFT0_ADCMP_ACSD5_ZE                 *((volatile  uint8_t *)(0x42403D3CUL))

#define bFM_MFT0_FRT_TCAL_STOP00                  *((volatile  uint8_t *)(0x42402C80UL))
#define bFM0P_MFT0_FRT_TCAL_STOP00                *((volatile  uint8_t *)(0x42402C80UL))
#define bFM_MFT0_FRT_TCAL_STOP01                  *((volatile  uint8_t *)(0x42402C84UL))
#define bFM0P_MFT0_FRT_TCAL_STOP01                *((volatile  uint8_t *)(0x42402C84UL))
#define bFM_MFT0_FRT_TCAL_STOP02                  *((volatile  uint8_t *)(0x42402C88UL))
#define bFM0P_MFT0_FRT_TCAL_STOP02                *((volatile  uint8_t *)(0x42402C88UL))
#define bFM_MFT0_FRT_TCAL_STOP10                  *((volatile  uint8_t *)(0x42402C8CUL))
#define bFM0P_MFT0_FRT_TCAL_STOP10                *((volatile  uint8_t *)(0x42402C8CUL))
#define bFM_MFT0_FRT_TCAL_STOP11                  *((volatile  uint8_t *)(0x42402C90UL))
#define bFM0P_MFT0_FRT_TCAL_STOP11                *((volatile  uint8_t *)(0x42402C90UL))
#define bFM_MFT0_FRT_TCAL_STOP12                  *((volatile  uint8_t *)(0x42402C94UL))
#define bFM0P_MFT0_FRT_TCAL_STOP12                *((volatile  uint8_t *)(0x42402C94UL))
#define bFM_MFT0_FRT_TCAL_STOP20                  *((volatile  uint8_t *)(0x42402C98UL))
#define bFM0P_MFT0_FRT_TCAL_STOP20                *((volatile  uint8_t *)(0x42402C98UL))
#define bFM_MFT0_FRT_TCAL_STOP21                  *((volatile  uint8_t *)(0x42402C9CUL))
#define bFM0P_MFT0_FRT_TCAL_STOP21                *((volatile  uint8_t *)(0x42402C9CUL))
#define bFM_MFT0_FRT_TCAL_STOP22                  *((volatile  uint8_t *)(0x42402CA0UL))
#define bFM0P_MFT0_FRT_TCAL_STOP22                *((volatile  uint8_t *)(0x42402CA0UL))
#define bFM_MFT0_FRT_TCAL_SCLR00                  *((volatile  uint8_t *)(0x42402CC0UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR00                *((volatile  uint8_t *)(0x42402CC0UL))
#define bFM_MFT0_FRT_TCAL_SCLR01                  *((volatile  uint8_t *)(0x42402CC4UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR01                *((volatile  uint8_t *)(0x42402CC4UL))
#define bFM_MFT0_FRT_TCAL_SCLR02                  *((volatile  uint8_t *)(0x42402CC8UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR02                *((volatile  uint8_t *)(0x42402CC8UL))
#define bFM_MFT0_FRT_TCAL_SCLR10                  *((volatile  uint8_t *)(0x42402CCCUL))
#define bFM0P_MFT0_FRT_TCAL_SCLR10                *((volatile  uint8_t *)(0x42402CCCUL))
#define bFM_MFT0_FRT_TCAL_SCLR11                  *((volatile  uint8_t *)(0x42402CD0UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR11                *((volatile  uint8_t *)(0x42402CD0UL))
#define bFM_MFT0_FRT_TCAL_SCLR12                  *((volatile  uint8_t *)(0x42402CD4UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR12                *((volatile  uint8_t *)(0x42402CD4UL))
#define bFM_MFT0_FRT_TCAL_SCLR20                  *((volatile  uint8_t *)(0x42402CD8UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR20                *((volatile  uint8_t *)(0x42402CD8UL))
#define bFM_MFT0_FRT_TCAL_SCLR21                  *((volatile  uint8_t *)(0x42402CDCUL))
#define bFM0P_MFT0_FRT_TCAL_SCLR21                *((volatile  uint8_t *)(0x42402CDCUL))
#define bFM_MFT0_FRT_TCAL_SCLR22                  *((volatile  uint8_t *)(0x42402CE0UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR22                *((volatile  uint8_t *)(0x42402CE0UL))

#define bFM_MFT0_FRT_TCSA0_SCLR                   *((volatile  uint8_t *)(0x42402910UL))
#define bFM0P_MFT0_FRT_TCSA0_SCLR                 *((volatile  uint8_t *)(0x42402910UL))
#define bFM_MFT0_FRT_TCSA0_MODE                   *((volatile  uint8_t *)(0x42402914UL))
#define bFM0P_MFT0_FRT_TCSA0_MODE                 *((volatile  uint8_t *)(0x42402914UL))
#define bFM_MFT0_FRT_TCSA0_STOP                   *((volatile  uint8_t *)(0x42402918UL))
#define bFM0P_MFT0_FRT_TCSA0_STOP                 *((volatile  uint8_t *)(0x42402918UL))
#define bFM_MFT0_FRT_TCSA0_BFE                    *((volatile  uint8_t *)(0x4240291CUL))
#define bFM0P_MFT0_FRT_TCSA0_BFE                  *((volatile  uint8_t *)(0x4240291CUL))
#define bFM_MFT0_FRT_TCSA0_ICRE                   *((volatile  uint8_t *)(0x42402920UL))
#define bFM0P_MFT0_FRT_TCSA0_ICRE                 *((volatile  uint8_t *)(0x42402920UL))
#define bFM_MFT0_FRT_TCSA0_ICLR                   *((volatile  uint8_t *)(0x42402924UL))
#define bFM0P_MFT0_FRT_TCSA0_ICLR                 *((volatile  uint8_t *)(0x42402924UL))
#define bFM_MFT0_FRT_TCSA0_IRQZE                  *((volatile  uint8_t *)(0x42402934UL))
#define bFM0P_MFT0_FRT_TCSA0_IRQZE                *((volatile  uint8_t *)(0x42402934UL))
#define bFM_MFT0_FRT_TCSA0_IRQZF                  *((volatile  uint8_t *)(0x42402938UL))
#define bFM0P_MFT0_FRT_TCSA0_IRQZF                *((volatile  uint8_t *)(0x42402938UL))
#define bFM_MFT0_FRT_TCSA0_ECKE                   *((volatile  uint8_t *)(0x4240293CUL))
#define bFM0P_MFT0_FRT_TCSA0_ECKE                 *((volatile  uint8_t *)(0x4240293CUL))

